In [1]:
import pandas as pd
import tensorflow as tf
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import classification_report, accuracy_score, recall_score

In [2]:
train = pd.read_csv('.\\data\\train.csv')

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train_data = train.dropna().copy()[["Survived", "Age", "Pclass", "Fare", "Embarked"]]
le_dim = {}

for col in train_data.select_dtypes("O").columns:
    le_dim[col] = LabelEncoder()
    train_data[col] = le_dim[col].fit_transform(train_data[col])
train_data

     Survived   Age  Pclass     Fare  Embarked
1           1  38.0       1  71.2833         0
3           1  35.0       1  53.1000         2
6           0  54.0       1  51.8625         2
10          1   4.0       3  16.7000         2
11          1  58.0       1  26.5500         2
..        ...   ...     ...      ...       ...
871         1  47.0       1  52.5542         2
872         0  33.0       1   5.0000         2
879         1  56.0       1  83.1583         0
887         1  19.0       1  30.0000         2
889         1  26.0       1  30.0000         0

[183 rows x 5 columns]

In [5]:
X = train_data.drop(columns=["Survived"])
y = train_data["Survived"]

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.5, random_state=42)

In [6]:
X

      Age  Pclass     Fare  Embarked
1    38.0       1  71.2833         0
3    35.0       1  53.1000         2
6    54.0       1  51.8625         2
10    4.0       3  16.7000         2
11   58.0       1  26.5500         2
..    ...     ...      ...       ...
871  47.0       1  52.5542         2
872  33.0       1   5.0000         2
879  56.0       1  83.1583         0
887  19.0       1  30.0000         2
889  26.0       1  30.0000         0

[183 rows x 4 columns]

In [7]:
X.shape

(183, 4)

In [8]:
X.iloc[1]

Age         35.0
Pclass       1.0
Fare        53.1
Embarked     2.0
Name: 3, dtype: float64

In [9]:
X.iloc[1].to_numpy()

array([35. ,  1. , 53.1,  2. ])

In [10]:
np.round(1.22)

1.0

In [ ]:
model = tf.keras.Sequential([
    tf.keras.layers.Dense(64, activation='sigmoid', input_shape=(X.shape[1],)),  # 2 é o número de variáveis de entrada
    tf.keras.layers.Dense(32, activation='leaky_relu'),
    # tf.keras.layers.Dense(128, activation='relu'),
    tf.keras.layers.Dense(1)
])

In [ ]:
# Compilando o modelo
model.compile(optimizer='adam', loss='binary_crossentropy', metrics=['accuracy'])

In [ ]:
# Treinando o modelo
model.fit(X_train, y_train, epochs=1000000, batch_size=128, validation_data=(X_test, y_test))

In [ ]:
print(classification_report(tf.math.round(model.predict(X_test, batch_size=256)).numpy().flatten().astype(int), y_test))

In [ ]:
# Avaliando o modelo
loss, accuracy = model.evaluate(X_test, y_test)
print(f'Acurácia no conjunto de teste: {accuracy * 100:.2f}%')

In [ ]:
cls = RandomForestClassifier(n_estimators=100)
cls.fit(X_train, y_train)

In [ ]:
accuracy_score(y_test, cls.predict(X_test))

In [ ]:
recall_score(y_test, cls.predict(X_test))

In [ ]:
print(classification_report(y_test, cls.predict(X_test)))